#Первое задание
a = (int(input('Введите первое число: ')))
b =(int(input('Введите второе число: ')))
if a > b:
    print('Первое число больше второго числа')
elif a < b:
    print('Второе число больше первого числа')
else:
    print('Числа равны')
#Второе задание
a = (int, float(input('Введите первое число: ')))
b =(int, float(input('Введите второе число: ')))
if a > b:
    print('Первое число больше второго числа')
elif a < b:
    print('Второе число больше первого числа')
else:
    print('Числа равны')
